todo.html
---
collections: page
layout: page
title: TODO
date: 2015-08-03
categories: 
-
tags: 
- todo
author: carltonf
excerpt: A TODO list
---
<p>
We list some long-term TODO entries here. For now only entries related to this
blog site are included.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Blog Roadmap</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="todo TODO">TODO</span> Populate Wiki.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For quite a long time, we've built a <code>Git</code> repo (locally called <code>ICWiki</code> ;) that
collects bits of knowledge for personal use. This task is about itemize it and
put online under the <code>Wiki</code> page.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="todo TODO">TODO</span> Wiki Style Improvements <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-2">
</div><ul class="org-ul"><li><a id="sec-1-2-1" name="sec-1-2-1"></a><span class="todo TODO">TODO</span> Sidebar Recent listing includes <code>Wiki</code><br  /><div class="outline-text-4" id="text-1-2-1">
<p>
Further include posts from all collections.
</p>
</div>
</li>

<li><a id="sec-1-2-2" name="sec-1-2-2"></a><span class="todo TODO">TODO</span> Alphabetical Listing<br  /><div class="outline-text-4" id="text-1-2-2">
<p>
<b>Waiting for at least &gt;50 entries to justify this task</b>
</p>

<p>
List <code>Wiki</code> entries alphabetically with each alphabet as a panel (would be a
good use case for <code>Bootstrap</code> collapse panels).
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="todo TODO">TODO</span> Philosophy Collection</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I'm not a philosopher by trade, but a philosophical man (self-titled :P). Over
the years, I have pondered on many different problems, aggregated some
"interesting" ideas. I've been through the stages: 
</p>

<pre class="example">
"delusion of knowing all" -&gt; "disillusion and break-down" -&gt; "rebuilding"
</pre>

<p>
The years since the sophomore year in the college have not been good to me.
Though being accused of thinking too much, I start to find out it's the
opposite: I've known too little and I was too ignorant. And thus I need to
collect my thoughts, trace the roots, systematize the scattered ideas and learn
more.
</p>
</div>
</div>
</div>
